using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace HW4
{

    /*
     2. შექმენით გეომეტრიული ფიგურის Figura საბაზო კლასი, რომელშიც სამი დაცული
გვერდია გამოცხადებული. განსაზღვრულია ასევე ორი კონსტრუქტორი. პირველ
კონსტრუქტორს სამი პარამეტრი აქვს და ახდენს სამივე გვერდის ინიციალიზებას.
მეორე კონსტრუქტორს ერთი პარამეტრი აქვს და ახდენს ერთი გვერდის
ინიციალიზებას. შექმენით მისი მემკვიდრე Samkutxedi და Kvadrati კლასები.
Samkutxedi კლასში გამოცხადებულია პრივატული ცვლადი - პერიმეტრი.
Samkutxedi კლასის კონსტრუქტორი იძახებს წინაპარი კლასის კონსტრუქტორს
გვერდების ზომების განსაზღვრის მიზნით. თვით ამ კონსტრუქტორში
გამოითვლება სამკუთხედის პერიმეტრი. ამავე კლასის მეორე ღია მეთოდი
გვიბრუნებს სამკუთხედის პერიმეტრს. Kvadrati კლასში გამოცხადებულია
პრივატული ცვლადი - ფართობი. Kvadrati კლასის კონსტრუქტორი იძახებს
წინაპარი კლასის კონსტრუქტორს გვერდის ზომის განსაზღვრის მიზნით. თვით
ამ კონსტრუქტორში ხდება კვადრატის ფართობის გამოთვლა. ამავე კლასის მეორე
ღია მეთოდი გვიბრუნებს კვადრატის ფართობს. მთავარ პროგრამაში შექმენით
Samkutxedi და Kvadrati კლასის ტიპის მქონე ობიექტები და გამოიძახეთ
მეთოდები.*/
    class Figura
    {
        protected int gverdi1;
        protected int gverdi2;
        protected int gverdi3;

        public Figura(int gverdi1, int gverdi2, int gverdi3)
        {
            this.gverdi1 = gverdi1;
            this.gverdi2 = gverdi2;
            this.gverdi3 = gverdi3;
        }

        public Figura(int gverdi1)
        {
            this.gverdi1 = gverdi1;
        }

    }

}
